{
  "backend/main.mo": "Motoko canister managing user profiles and image edit metadata with authorization checks for viewing and saving.",
  "feature_evidence.json": "Feature mapping file linking implemented frontend/backend files to product features and requirements.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of all major frontend source files for reference.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color tokens and dark mode variants.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling image upload, editor tools, authentication, and UI panels.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with react-query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog shown after login prompting new users to enter and save a display name.",
  "frontend/src/editor/components/EditorCanvas.tsx": "Renders a canvas and applies image processing to the original image based on current settings.",
  "frontend/src/editor/components/EditSessionsPanel.tsx": "Provides UI to save current editor settings with a name and load recent saved sessions from backend.",
  "frontend/src/editor/components/ExportPanel.tsx": "Allows selecting export format and JPEG quality and triggers exporting the edited image.",
  "frontend/src/editor/components/ProcessingOverlay.tsx": "Displays a full‑screen processing overlay with a spinner and status text.",
  "frontend/src/editor/components/tools/AdjustmentsPanel.tsx": "Offers sliders for brightness, contrast, and saturation adjustments with change callbacks.",
  "frontend/src/editor/components/tools/CropPanel.tsx": "Handles selecting aspect ratios and applying or clearing a crop rectangle for the image.",
  "frontend/src/editor/components/tools/TransformPanel.tsx": "Provides buttons to rotate or flip the image horizontally or vertically.",
  "frontend/src/editor/copy/uiText.ts": "Contains all UI text strings for the editor, organized by feature.",
  "frontend/src/editor/hooks/useEditorState.ts": "Manages editor settings state with update, reset, and apply helpers.",
  "frontend/src/editor/hooks/useProcessingIndicator.ts": "Tracks whether image processing is active with start/stop controls.",
  "frontend/src/editor/hooks/useUndoRedo.ts": "Implements undo/redo history for editor settings with a capped history buffer.",
  "frontend/src/editor/processing/canvasPipeline.ts": "Processes an image on a canvas by applying crop, rotation, flip, and pixel-level adjustments like brightness, contrast, and saturation.",
  "frontend/src/editor/types.ts": "Defines the EditorSettings interface and default values for image editing parameters such as brightness, rotation, flips, and crop.",
  "frontend/src/editor/utils/exportImage.ts": "Applies image processing to a temporary canvas and exports the result as a downloadable PNG or JPEG blob.",
  "frontend/src/editor/utils/fileValidation.ts": "Validates uploaded image files by checking MIME type and enforcing a 50MB size limit.",
  "frontend/src/editor/utils/serializeSettings.ts": "Provides JSON-based serialization and deserialization for EditorSettings with defaults applied.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark theme CSS variables using OKLCH color values.",
  "frontend/src/integrations/backend/hooks/useEditSessions.ts": "Hooks for fetching recent edit metadata and saving new image edit metadata through the backend actor.",
  "frontend/src/integrations/backend/hooks/useUserProfile.ts": "Hooks for retrieving and updating the caller's user profile via the backend actor.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugin integrations.",
  "project_state.json": "Holds project metadata, feature definitions, and image requirements for a browser-based photo editor. Includes existing features, versioning, and partial new feature requests."
}